# Задача 1. Различия между threading, multiprocessing и async в Python
# Задача: Напишите три различных программы на Python, использующие каждый из подходов: threading, multiprocessing и async. Каждая программа должна решать считать сумму всех чисел от 1 до 10000000000000. Разделите вычисления на несколько параллельных задач для ускорения выполнения.
# Подробности задания:
# Напишите программу на Python для каждого подхода: threading, multiprocessing и async.
# Каждая программа должна содержать функцию calculate_sum(), которая будет выполнять вычисления.
# Для threading используйте модуль threading, для multiprocessing - модуль multiprocessing, а для async - ключевые слова async/await и модуль asyncio.
# Каждая программа должна разбить задачу на несколько подзадач и выполнять их параллельно.
# Замерьте время выполнения каждой программы и сравните результаты.